; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=270, out_folder=./training, instance_id=15, seed=2039, goal_proportion=0.03

(define (problem blocksworld-15)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 - object)
 (:init 
    (arm-empty)
    (clear b50)
    (on-table b50)
    (clear b139)
    (on-table b139)
    (clear b72)
    (on b72 b35)
    (on b35 b94)
    (on b94 b135)
    (on b135 b269)
    (on b269 b65)
    (on-table b65)
    (clear b247)
    (on b247 b220)
    (on b220 b20)
    (on-table b20)
    (clear b88)
    (on b88 b97)
    (on b97 b51)
    (on b51 b172)
    (on-table b172)
    (clear b142)
    (on-table b142)
    (clear b243)
    (on b243 b204)
    (on b204 b207)
    (on b207 b122)
    (on b122 b187)
    (on-table b187)
    (clear b17)
    (on-table b17)
    (clear b67)
    (on-table b67)
    (clear b2)
    (on b2 b233)
    (on b233 b3)
    (on-table b3)
    (clear b209)
    (on b209 b141)
    (on b141 b48)
    (on b48 b59)
    (on b59 b180)
    (on b180 b197)
    (on b197 b165)
    (on-table b165)
    (clear b111)
    (on-table b111)
    (clear b232)
    (on b232 b126)
    (on b126 b236)
    (on b236 b70)
    (on b70 b32)
    (on b32 b196)
    (on-table b196)
    (clear b64)
    (on b64 b46)
    (on b46 b15)
    (on-table b15)
    (clear b208)
    (on b208 b198)
    (on b198 b261)
    (on b261 b231)
    (on b231 b73)
    (on-table b73)
    (clear b244)
    (on-table b244)
    (clear b175)
    (on b175 b185)
    (on b185 b199)
    (on-table b199)
    (clear b258)
    (on-table b258)
    (clear b170)
    (on b170 b225)
    (on b225 b49)
    (on-table b49)
    (clear b254)
    (on b254 b61)
    (on b61 b250)
    (on b250 b71)
    (on-table b71)
    (clear b195)
    (on b195 b131)
    (on b131 b45)
    (on b45 b214)
    (on-table b214)
    (clear b79)
    (on b79 b23)
    (on b23 b205)
    (on-table b205)
    (clear b169)
    (on b169 b25)
    (on b25 b154)
    (on b154 b268)
    (on b268 b57)
    (on b57 b100)
    (on b100 b267)
    (on-table b267)
    (clear b173)
    (on-table b173)
    (clear b104)
    (on b104 b125)
    (on b125 b161)
    (on-table b161)
    (clear b266)
    (on b266 b129)
    (on b129 b113)
    (on-table b113)
    (clear b235)
    (on b235 b36)
    (on b36 b114)
    (on b114 b128)
    (on b128 b39)
    (on b39 b263)
    (on-table b263)
    (clear b123)
    (on b123 b56)
    (on b56 b181)
    (on b181 b262)
    (on b262 b8)
    (on b8 b107)
    (on b107 b28)
    (on b28 b118)
    (on b118 b62)
    (on-table b62)
    (clear b194)
    (on-table b194)
    (clear b242)
    (on-table b242)
    (clear b144)
    (on b144 b87)
    (on b87 b228)
    (on b228 b248)
    (on b248 b184)
    (on b184 b66)
    (on-table b66)
    (clear b11)
    (on b11 b89)
    (on-table b89)
    (clear b119)
    (on-table b119)
    (clear b149)
    (on b149 b264)
    (on b264 b91)
    (on b91 b206)
    (on-table b206)
    (clear b76)
    (on b76 b171)
    (on-table b171)
    (clear b108)
    (on b108 b16)
    (on b16 b34)
    (on b34 b42)
    (on-table b42)
    (clear b227)
    (on b227 b5)
    (on b5 b224)
    (on b224 b117)
    (on b117 b157)
    (on b157 b253)
    (on b253 b211)
    (on b211 b138)
    (on-table b138)
    (clear b84)
    (on b84 b10)
    (on b10 b80)
    (on b80 b112)
    (on b112 b246)
    (on b246 b137)
    (on b137 b257)
    (on-table b257)
    (clear b43)
    (on b43 b265)
    (on-table b265)
    (clear b106)
    (on b106 b212)
    (on-table b212)
    (clear b99)
    (on b99 b178)
    (on b178 b145)
    (on b145 b6)
    (on-table b6)
    (clear b182)
    (on b182 b163)
    (on b163 b96)
    (on b96 b116)
    (on b116 b189)
    (on b189 b31)
    (on b31 b130)
    (on b130 b177)
    (on-table b177)
    (clear b60)
    (on b60 b226)
    (on b226 b143)
    (on b143 b255)
    (on b255 b74)
    (on b74 b83)
    (on b83 b105)
    (on-table b105)
    (clear b168)
    (on b168 b237)
    (on b237 b93)
    (on-table b93)
    (clear b158)
    (on-table b158)
    (clear b183)
    (on b183 b120)
    (on b120 b191)
    (on b191 b151)
    (on b151 b230)
    (on b230 b223)
    (on b223 b110)
    (on b110 b26)
    (on b26 b1)
    (on b1 b222)
    (on b222 b202)
    (on b202 b166)
    (on b166 b127)
    (on b127 b193)
    (on b193 b30)
    (on-table b30)
    (clear b213)
    (on-table b213)
    (clear b219)
    (on b219 b134)
    (on-table b134)
    (clear b21)
    (on-table b21)
    (clear b192)
    (on b192 b40)
    (on b40 b27)
    (on-table b27)
    (clear b81)
    (on b81 b215)
    (on-table b215)
    (clear b4)
    (on b4 b47)
    (on b47 b52)
    (on b52 b54)
    (on b54 b238)
    (on b238 b155)
    (on b155 b256)
    (on-table b256)
    (clear b38)
    (on b38 b251)
    (on-table b251)
    (clear b92)
    (on b92 b77)
    (on b77 b221)
    (on b221 b176)
    (on b176 b53)
    (on b53 b188)
    (on b188 b98)
    (on b98 b140)
    (on b140 b136)
    (on b136 b245)
    (on b245 b133)
    (on b133 b75)
    (on b75 b201)
    (on b201 b216)
    (on b216 b85)
    (on b85 b44)
    (on-table b44)
    (clear b19)
    (on-table b19)
    (clear b270)
    (on-table b270)
    (clear b82)
    (on b82 b156)
    (on-table b156)
    (clear b115)
    (on b115 b249)
    (on b249 b179)
    (on b179 b33)
    (on b33 b150)
    (on-table b150)
    (clear b146)
    (on b146 b37)
    (on b37 b29)
    (on b29 b121)
    (on-table b121)
    (clear b218)
    (on b218 b147)
    (on b147 b22)
    (on b22 b167)
    (on b167 b90)
    (on b90 b239)
    (on b239 b41)
    (on b41 b86)
    (on b86 b58)
    (on-table b58)
    (clear b174)
    (on b174 b241)
    (on b241 b190)
    (on b190 b63)
    (on-table b63)
    (clear b24)
    (on b24 b252)
    (on b252 b152)
    (on b152 b162)
    (on b162 b109)
    (on b109 b18)
    (on b18 b102)
    (on b102 b259)
    (on-table b259)
    (clear b160)
    (on b160 b229)
    (on b229 b14)
    (on b14 b124)
    (on-table b124)
    (clear b234)
    (on b234 b95)
    (on b95 b186)
    (on b186 b210)
    (on-table b210)
    (clear b69)
    (on b69 b103)
    (on b103 b260)
    (on b260 b55)
    (on b55 b9)
    (on b9 b217)
    (on b217 b200)
    (on b200 b12)
    (on b12 b153)
    (on b153 b68)
    (on b68 b78)
    (on b78 b159)
    (on b159 b101)
    (on b101 b240)
    (on-table b240)
    (clear b13)
    (on-table b13)
    (clear b164)
    (on b164 b148)
    (on-table b148)
    (clear b132)
    (on b132 b7)
    (on b7 b203)
    (on-table b203))
 (:goal  (and 
    (clear b8)
    (on b8 b6)
    (on b6 b7)
    (on b7 b2)
    (on b2 b4)
    (on b4 b3)
    (on-table b3)
    (clear b5)
    (on b5 b1)
    (on-table b1))))

; plan
1. (unstack b123 b56)
   deleted: (on b123 b56) (clear b123) (arm-empty)
   added: (holding b123) (clear b56)
   goals met: 1 of 10
2. (putdown b123)
   deleted: (holding b123)
   added: (clear b123) (arm-empty) (on-table b123)
   goals met: 1 of 10
3. (unstack b132 b7)
   deleted: (on b132 b7) (clear b132) (arm-empty)
   added: (holding b132) (clear b7)
   goals met: 1 of 10
4. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 1 of 10
5. (unstack b183 b120)
   deleted: (on b183 b120) (clear b183) (arm-empty)
   added: (holding b183) (clear b120)
   goals met: 1 of 10
6. (putdown b183)
   deleted: (holding b183)
   added: (clear b183) (arm-empty) (on-table b183)
   goals met: 1 of 10
7. (unstack b120 b191)
   deleted: (on b120 b191) (clear b120) (arm-empty)
   added: (holding b120) (clear b191)
   goals met: 1 of 10
8. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 1 of 10
9. (unstack b191 b151)
   deleted: (on b191 b151) (clear b191) (arm-empty)
   added: (holding b191) (clear b151)
   goals met: 1 of 10
10. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 1 of 10
11. (unstack b151 b230)
   deleted: (on b151 b230) (clear b151) (arm-empty)
   added: (holding b151) (clear b230)
   goals met: 1 of 10
12. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 1 of 10
13. (unstack b227 b5)
   deleted: (on b227 b5) (clear b227) (arm-empty)
   added: (holding b227) (clear b5)
   goals met: 2 of 10
14. (putdown b227)
   deleted: (holding b227)
   added: (clear b227) (arm-empty) (on-table b227)
   goals met: 2 of 10
15. (unstack b230 b223)
   deleted: (on b230 b223) (clear b230) (arm-empty)
   added: (holding b230) (clear b223)
   goals met: 2 of 10
16. (putdown b230)
   deleted: (holding b230)
   added: (clear b230) (arm-empty) (on-table b230)
   goals met: 2 of 10
17. (unstack b223 b110)
   deleted: (on b223 b110) (clear b223) (arm-empty)
   added: (holding b223) (clear b110)
   goals met: 2 of 10
18. (putdown b223)
   deleted: (holding b223)
   added: (clear b223) (arm-empty) (on-table b223)
   goals met: 2 of 10
19. (unstack b110 b26)
   deleted: (on b110 b26) (clear b110) (arm-empty)
   added: (holding b110) (clear b26)
   goals met: 2 of 10
20. (putdown b110)
   deleted: (holding b110)
   added: (clear b110) (arm-empty) (on-table b110)
   goals met: 2 of 10
21. (unstack b26 b1)
   deleted: (on b26 b1) (clear b26) (arm-empty)
   added: (holding b26) (clear b1)
   goals met: 2 of 10
22. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 2 of 10
23. (unstack b1 b222)
   deleted: (on b1 b222) (clear b1) (arm-empty)
   added: (holding b1) (clear b222)
   goals met: 2 of 10
24. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 10
25. (unstack b56 b181)
   deleted: (on b56 b181) (clear b56) (arm-empty)
   added: (holding b56) (clear b181)
   goals met: 3 of 10
26. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 3 of 10
27. (unstack b181 b262)
   deleted: (on b181 b262) (clear b181) (arm-empty)
   added: (holding b181) (clear b262)
   goals met: 3 of 10
28. (putdown b181)
   deleted: (holding b181)
   added: (clear b181) (arm-empty) (on-table b181)
   goals met: 3 of 10
29. (unstack b262 b8)
   deleted: (on b262 b8) (clear b262) (arm-empty)
   added: (holding b262) (clear b8)
   goals met: 4 of 10
30. (putdown b262)
   deleted: (holding b262)
   added: (clear b262) (arm-empty) (on-table b262)
   goals met: 4 of 10
31. (unstack b99 b178)
   deleted: (on b99 b178) (clear b99) (arm-empty)
   added: (holding b99) (clear b178)
   goals met: 4 of 10
32. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 4 of 10
33. (unstack b178 b145)
   deleted: (on b178 b145) (clear b178) (arm-empty)
   added: (holding b178) (clear b145)
   goals met: 4 of 10
34. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 4 of 10
35. (unstack b145 b6)
   deleted: (on b145 b6) (clear b145) (arm-empty)
   added: (holding b145) (clear b6)
   goals met: 4 of 10
36. (putdown b145)
   deleted: (holding b145)
   added: (clear b145) (arm-empty) (on-table b145)
   goals met: 4 of 10
37. (unstack b2 b233)
   deleted: (on b2 b233) (clear b2) (arm-empty)
   added: (holding b2) (clear b233)
   goals met: 4 of 10
38. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 5 of 10
39. (unstack b233 b3)
   deleted: (on b233 b3) (clear b233) (arm-empty)
   added: (holding b233) (clear b3)
   goals met: 5 of 10
40. (putdown b233)
   deleted: (holding b233)
   added: (clear b233) (arm-empty) (on-table b233)
   goals met: 5 of 10
41. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 5 of 10
42. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 6 of 10
43. (unstack b5 b224)
   deleted: (on b5 b224) (clear b5) (arm-empty)
   added: (holding b5) (clear b224)
   goals met: 5 of 10
44. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 7 of 10
45. (unstack b8 b107)
   deleted: (on b8 b107) (clear b8) (arm-empty)
   added: (holding b8) (clear b107)
   goals met: 6 of 10
46. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 8 of 10
47. (unstack b2 b4)
   deleted: (on b2 b4) (clear b2) (arm-empty)
   added: (holding b2) (clear b4)
   goals met: 7 of 10
48. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 10
49. (unstack b4 b47)
   deleted: (on b4 b47) (clear b4) (arm-empty)
   added: (holding b4) (clear b47)
   goals met: 7 of 10
50. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 8 of 10
51. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 8 of 10
52. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 9 of 10
53. (unstack b8 b6)
   deleted: (on b8 b6) (clear b8) (arm-empty)
   added: (holding b8) (clear b6)
   goals met: 7 of 10
54. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 8 of 10
55. (unstack b6 b7)
   deleted: (on b6 b7) (clear b6) (arm-empty)
   added: (holding b6) (clear b7)
   goals met: 7 of 10
56. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 7 of 10
57. (unstack b7 b203)
   deleted: (on b7 b203) (clear b7) (arm-empty)
   added: (holding b7) (clear b203)
   goals met: 7 of 10
58. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 8 of 10
59. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 10
60. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 9 of 10
61. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 8 of 10
62. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 10 of 10
